{"title":"What is Trello and Why should you use it","coverimage":"trello.png","meta":{"index":0,"fileName":"2018-09-03-what-is-trello-and-why-use-it.md","section":"/","dirName":"/wip"},"date":"2018-09-03","path":"/what-is-trello-and-why-use-it","permalink":"/what-is-trello-and-why-use-it","anchors":[["#what-is-trello-and-why-should-you-use-it","What is Trello and Why should you use it"]],"body":"<h1 id=\"what-is-trello-and-why-should-you-use-it\">What is Trello and Why should you use it</h1>\n<p><a href=\"https://www.groovypost.com/howto/what-is-trello/\" target=\"_blank\" rel=\"noopener\">ref link</a></p>\n<p>If you are involved in lots of work projects or if you are self-employed, then effective project management is much. If you don’t plan your time and effort, then you will end up frittering it away on Facebook and missing deadlines as a result (I speak from experience). Online project management tool industry is highly competitive but the one that seems to be winning above all others is Trello.</p>\n<p>Trello is beloved by those obsessed with managing their time and projects and it is easy to see why. Not only is Trello cheap and affordable, but also extremely simple to use. Using a highly visual approach to time and project management, you can move cards around so you can see at a glance what needs to be done and when.</p>\n<h2 id=\"a-closer-look-at-trello\">A Closer Look At Trello</h2>\n<p>Trello has been described by some as “Post-it notes on steroids.” On the screen, you make “lists” like a big whiteboard on the wall. Then on each list are “cards,” like Post-it notes. On each card is a separate to-do item.</p>\n<p>As you progress with the to-do item, you can use your mouse to drag the card from say “in progress” to “finished” (or whatever wording you prefer).</p>\n<p>The Four Main Features Of Trello\nWe will look at each feature in a bit more detail in a moment. But here are the four main things to focus on, if you look at the screenshot above.</p>\n<p>Each card can be color-coded with a bar. Each color can refer to a different client for example.\nThe icon showing the gravatar/picture of the user shows who is participating in that card. You can invite people to a card so they can leave feedback and updates. Or if you want to assign them that task. If a task is assigned, a due date can be added and a reminder sent when the due date is near. When the card is updated, everyone on that card is notified.\nThe background of each Trello board can be customized. Trello gives you backgrounds or you can upload your own. Being a Lego fanatic, I uploaded this Lego one. But if you are a company, you can customize your Trello board with say the company logo.\nCards can be moved to other boards, copied to other boards, or archived when finished.\nStarting a New Board\nThe first step is to add a new board. In the top-right hand corner of the screen (once you are logged in), press the + button. Then choose “Create Board“ from the drop-down list.</p>\n<p>You will then be asked to give the board a name, a privacy level, and a background. If you have created a team already, you can choose to assign the board to that team.</p>\n<p>A quick word on privacy levels: If the board is left public, then it will be indexed by search engines and accessed by anybody who finds it on Google. It was recently revealed that employees at Uber were using Trello to list sensitive company passwords, which were then getting picked up by Google.</p>\n<p>So be careful and if you MUST use Trello for passwords, set the privacy level to Private. Although for passwords, you should really be using a password manager.</p>\n<p>Adding a New List\nOnce you have your new board, it is time to start a new list. You can make it any way you want but I normally make my boards with lists at various stages of a process. So “pending,” “in progress“ and so forth. Or you can have lists for projects that have multiple tasks such as “decorating the house,” “achieving world peace,” and “conquering outer space.”</p>\n<p>To add a new list, click on Add a list.</p>\n<p>Then type in the title of that list and save it.</p>\n<p>Rinse and repeat for any other lists that board needs (if any).</p>\n<p>Adding a New Card\nNow it’s time to add a new card, and there are various different elements to a card that make it powerful.</p>\n<p>Making a New Card\nIn the appropriate list, click on Add a card.</p>\n<p>Now type in the task you want to add. Save it by clicking the green Add button.</p>\n<p>Repeat as before for other tasks you need to add (if any).</p>\n<p>But that is merely the start of what you can add to a card, which you can see if you click on it to open it up.</p>\n<p>Assigning Other Users</p>\n<p>First, if you have created a team, and others have been invited to access the board, you can assign someone to a particular task. Or merely tag them so they are looped into the conversation on that card.</p>\n<p>To add someone to the card, just click on Members and click the gravatar of the person you want to add. Similarly, they can be removed from a card by clicking the gravatar again.</p>\n<p>Adding Notes &amp; Attachments</p>\n<p>Whether for the benefit of your own memory or to advise others, leaving notes may become necessary. You can do so at the top of the note and also leave clickable links in there as well.</p>\n<p>Underneath the notes section is an area for uploading attachments. This can be anything from a document to a zip file to an image. If an image, the image will show on the card</p>\n<p>Adding a Due Date</p>\n<p>If a task has a deadline, you can assign a due date to it. Then you will get reminders when the date is getting closer, and when the date has passed.</p>\n<p>Adding Colored Labels</p>\n<p>I add colored labels to my work list to show what work is due to which clients. So red is for groovyPost for example.</p>\n<p>You can edit the labels to say anything you want, and you can add as many as you want to a card.</p>\n<p>Adding Comments\nIf other people have access to your cards, eventually they will start to leave comments. You can use the @ to tag people in specific comments and they will get a notification from Trello.</p>\n<p>Moving, Copying, Watching &amp; Archiving Cards</p>\n<p>There are also four other actions you can take on a card.</p>\n<p>Move\nIf you have multiple boards, you can move cards between one board and another. So if I wanted to move a card from the groovyPost board to one of my own personal boards, this option would move the card over. Along with all the comments, attachments, etc.</p>\n<p>Copy\nThis is the same as the Move option, except the card will not be completely moved. Just copied. I use this all the time for copying my groovyPost assignments to my own private work board.</p>\n<p>Watch\nIf someone else has a card on a board, you can choose to watch it and be notified of new comments, without actually participating yourself. Also known as “lurker mode” (well, I call it that).</p>\n<p>Archive\nThere’s no such thing as “delete” in Trello. Instead, to remove a card, a list, or a board, you “archive” it. It will then disappear but it can be easily brought back if you need it again later.</p>\n<p>Other Uses For Trello</p>\n<p>Trello has so many uses if you put your mind to it and think laterally. To that end, Trello has a page called “Trello Inspiration”. It gives you templates and countless usage ideas.</p>\n<p>Integrating Trello With Other Apps Using IFTTT.</p>\n<p>I am a big fan of IFTTT (If This Then That), and they have a huge number of automated scripts for Trello. Check them out.</p>\n<p>Conclusion\nThis has only just scratched the surface of what Trello can do to make your life more organized. Do you use Trello? If so, what do you use it for?</p>\n"}